fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>DefinedType.ВКМ_ДенежнаяСумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОкончаниеДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонентскаяПлата</name>
    <type>
      <types>DefinedType.ВКМ_ДенежнаяСумма</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимтостьЧаса</name>
    <type>
      <types>DefinedType.ВКМ_ДенежнаяСумма</types>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/CommonModules/ВКМ_АвтосозданиеИЗаполнениеРеализаций/Module.bsl
#Область СлужебныеПроцедурыИФункции
Процедура СформироватьАктыНаСервере(Параметры, АдресРезультата) Экспорт
	
Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.Владелец,
	|	ДоговорыКонтрагентов.Организация
	|ПОМЕСТИТЬ вт_ДействующиеДоговора
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора <= &ДатаДокумента
	|	И ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора >= &ДатаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ДействующиеДоговора.Ссылка КАК Договор,
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Контрагент КАК Контрагент,
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовОборот КАК КоличествоЧасовОборот,
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот КАК СуммаКОплатеОборот,
	|	ОбработкаЗаказовОбороты.СуммаОтгрузкиОборот КАК СуммаОтгрузкиОборот,
	|	вт_ДействующиеДоговора.Владелец,
	|	вт_ДействующиеДоговора.Организация
	|ИЗ
	|	вт_ДействующиеДоговора КАК вт_ДействующиеДоговора
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&НачалоМесяца, &КонецМесяца,,) КАК
	|			ВКМ_ВыполненныеКлиентуРаботыОбороты
	|		ПО вт_ДействующиеДоговора.Ссылка = ВКМ_ВыполненныеКлиентуРаботыОбороты.ДоговорКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбработкаЗаказов.Обороты(&НачалоМесяца, &КонецМесяца,,) КАК
	|			ОбработкаЗаказовОбороты
	|		ПО вт_ДействующиеДоговора.Ссылка = ОбработкаЗаказовОбороты.Договор";


	Запрос.УстановитьПараметр("ДатаДокумента", Параметры.ДатаДокумента);
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Параметры.ДатаДокумента));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Параметры.ДатаДокумента));

РезультатЗапроса = Запрос.Выполнить();

ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СуммаОтгрузкиОборот) Тогда
		ОбъектРеализации = Документы.РеализацияТоваровУслуг.СоздатьДокумент();	
//		ОбъектРеализации.Дата = Параметры.ДатаДокумента;
//		ОбъектРеализации.Контрагент = ВыборкаДетальныеЗаписи.Владелец;
//		ОбъектРеализации.Организация = ВыборкаДетальныеЗаписи.Организация;
//		ОбъектРеализации.Договор = ВыборкаДетальныеЗаписи.Договор;
//		ОбъектРеализации.Основание = ВыборкаДетальныеЗаписи.Договор;
//		ОбъектРеализации.Ответственный = Пользователи.ТекущийПользователь();
		СтруктураОбъекта = Новый Структура("Дата, Контрагент, Организация, Договор, Основание", 
					Параметры.ДатаДокумента, ВыборкаДетальныеЗаписи.Владелец, ВыборкаДетальныеЗаписи.Организация, ВыборкаДетальныеЗаписи.Договор,
						ВыборкаДетальныеЗаписи.Договор);
		ОбъектРеализации.Заполнить(СтруктураОбъекта);
		ОбъектРеализации.ВыполнитьАвтозаполнение(Параметры.ДатаДокумента, ВыборкаДетальныеЗаписи.Договор, ОбъектРеализации);
	
	КонецЕсли;
КонецЦикла;


КонецПроцедуры
#КонецОбласти
